# SetStorySuffix

## Description
Sets the suffix of the indicated Story. Returns whether the suffix was successfully set. If the suffix is already used by another Story, then the change in suffix will be prevented.

```pascal
FUNCTION SetStorySuffix(
				story  : HANDLE;
				suffix : STRING): BOOLEAN;
```

```python
def vs.SetStorySuffix(story, suffix):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|story|HANDLE|The story whose suffix is being set.|
|suffix|STRING|The new value of the suffix of the indicated Story.|

## Examples
```pascal
resultOK := SetStorySuffix(story, 'Example');
```
```python
import vs

# Sets the suffix of the indicated Story.
story = vs.FSActLayer()  # handle to the first selected object on the active layer
suffix = 'Example'

ok = vs.SetStorySuffix(story, suffix)
if ok:
    vs.Message('SetStorySuffix succeeded')
else:
    vs.Message('SetStorySuffix failed')
```

## See Also
VS Functions:
GetStorySuffix
| SetStoryElevation

## Version
Availability: from Vectorworks 2012

## Category
* Layers